# Coleta de dados

In [1]:
import sqlite3
import pandas as pd

1. Abrindo conex√£o com o banco de dados

In [2]:
conn = sqlite3.connect("/home/cristina/Public/projetos/flight_fidelity/db/database.db")

2. Consulta dos dados

In [3]:
def read_query(table):
    db = pd.read_sql_query(table, conn)
    return db.head()

In [4]:
# Selecionar estas colunas da tabela flight_loyalty_history
read_table = """ 
    SELECT 
        loyalty_number,
        loyalty_card, 
        country,
        city,
        gender,
        salary
    FROM 
        flight_loyalty_history
"""
read_query(read_table)

   loyalty_number loyalty_card country       city  gender    salary
0          480934         Star  Canada    Toronto  Female   83236.0
1          549612         Star  Canada   Edmonton    Male       NaN
2          429460         Star  Canada  Vancouver    Male       NaN
3          608370         Star  Canada    Toronto    Male       NaN
4          530508         Star  Canada       Hull    Male  103495.0

In [5]:
# Selecionar as mesmas colunas da tabela flight_loyalty_history com as linhas da coluna gender igual a female

query_ = """
    SELECT 
        loyalty_number,
        gender,
        country,
        city,
        salary,
        loyalty_card
    FROM flight_loyalty_history
    WHERE
        gender = 'Female'
"""

read_query(query_)

   loyalty_number  gender country          city    salary loyalty_card
0          480934  Female  Canada       Toronto   83236.0         Star
1          927943  Female  Canada       Toronto       NaN         Star
2          852392  Female  Canada      Montreal  100159.0         Star
3          932823  Female  Canada     Vancouver   66444.0         Star
4          144514  Female  Canada  Dawson Creek   49618.0         Star

In [6]:
query_booked = """
    SELECT
        loyalty_number,
        month, 
        year, 
        distance,
        flights_booked,
        total_flights
    FROM flight_activity
    WHERE flights_booked > 10 AND flights_booked < 12
"""
read_query(query_booked)

   loyalty_number  month  year  distance  flights_booked  total_flights
0          100727      1  2017      1144              11             11
1          100883      1  2017      3124              11             11
2          101515      1  2017      1100              11             11
3          101594      1  2017      3399              11             11
4          104353      1  2017      1343              11             17

In [7]:
conn.close()